# Group Project 6 —— ABC FOODMART
* Dong Wang, Yibo Wang, Xuelong Lyu, Tianyu Xu

In [1]:
!pip install psycopg2

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: psycopg2 in c:\users\wd785\appdata\roaming\python\python311\site-packages (2.9.9)

In [2]:
# Import the necessary library
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [3]:
# Define the connection URL with the appropriate credentials and database name
conn_url = 'postgresql://postgres:123@localhost/ABC_FOODMART'
# Create an engine object based on the connection URL
engine = create_engine(conn_url)
# Establish a connection to the database using the engine
connection = engine.connect()

In [4]:
stmt = '''
CREATE TABLE stores (
    store_id INT PRIMARY KEY,
    store_name VARCHAR(100) NOT NULL,
    store_street VARCHAR(100) NOT NULL,
    store_city VARCHAR(50) NOT NULL,
    store_state VARCHAR(2) NOT NULL,
    store_zipcode VARCHAR(10) NOT NULL,
    store_parking_capacity INT NOT NULL,
    store_open_date DATE NOT NULL
);

CREATE TABLE management(
    manager_id INT PRIMARY KEY,
    store_id INT NOT NULL,
    store_manager VARCHAR(100) NOT NULL,
    FOREIGN KEY (store_id) REFERENCES stores(store_id)
);

CREATE TABLE store_expense_type (
    expense_type_id INT PRIMARY KEY,
    store_expense_type VARCHAR(50) NOT NULL
);

CREATE TABLE store_expenses (
    store_id INT NOT NULL,
    store_expense_date DATE NOT NULL,
    expense_type_id INT NOT NULL,
    store_expense_amount DECIMAL(10, 2) NOT NULL,
    store_expense_description TEXT NOT NULL,
    PRIMARY KEY (store_id, store_expense_date, expense_type_id),
    FOREIGN KEY (store_id) REFERENCES stores(store_id),
    FOREIGN KEY (expense_type_id) REFERENCES store_expense_type(expense_type_id)
);

CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    employee_name VARCHAR(100) NOT NULL,
    email VARCHAR(100) UNIQUE NOT NULL,
    date_of_hire DATE NOT NULL
);

CREATE TABLE stations (
    station_id INT PRIMARY KEY,
    station VARCHAR(50) NOT NULL
);

CREATE TABLE shifts (
    shift_id INT PRIMARY KEY,
    employee_id INT NOT NULL,
    store_id INT NOT NULL,
    manager_id INT NOT NULL,
    station_id INT NOT NULL,
    shift_start TIMESTAMP NOT NULL,
    shift_end TIMESTAMP NOT NULL,
    hourly_pay_rate DECIMAL(10, 2) NOT NULL,
    FOREIGN KEY (employee_id) REFERENCES employees(employee_id),
    FOREIGN KEY (store_id) REFERENCES stores(store_id),
    FOREIGN KEY (manager_id) REFERENCES management(manager_id),
    FOREIGN KEY (station_id) REFERENCES stations(station_id)
);

CREATE TABLE categories (
    category_id INT PRIMARY KEY,
    category VARCHAR(50) NOT NULL
);

CREATE TABLE products (
    product_id INT PRIMARY KEY,
    category_id INT NOT NULL,
    product_name VARCHAR(100) NOT NULL,
    product_description TEXT NOT NULL,
    unit_of_measurement VARCHAR(20) NOT NULL,
    FOREIGN KEY (category_id) REFERENCES categories(category_id)
);

CREATE TABLE vendors (
    vendor_id INT PRIMARY KEY,
    vendor_name VARCHAR(100) NOT NULL,
    vendor_email VARCHAR(100) UNIQUE NOT NULL
);

CREATE TABLE orders (
    order_number CHAR(36) PRIMARY KEY,
    vendor_id INT NOT NULL,
    store_id INT NOT NULL,
    delivery_date DATE NOT NULL,
    FOREIGN KEY (vendor_id) REFERENCES vendors(vendor_id),
    FOREIGN KEY (store_id) REFERENCES stores(store_id)
);

CREATE TABLE order_details (
    order_id INT PRIMARY KEY,
    order_number CHAR(36) NOT NULL,
    product_id INT NOT NULL,
    quantity INT NOT NULL,
    price_per_unit DECIMAL(10, 2) NOT NULL,
    expiration_date DATE NOT NULL,
    FOREIGN KEY (order_number) REFERENCES orders(order_number),
    FOREIGN KEY (product_id) REFERENCES products(product_id)
);

CREATE TABLE customers (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(100) NOT NULL,
    customer_email VARCHAR(100) NOT NULL
);

CREATE TABLE sales (
    sales_id INT PRIMARY KEY,
    customer_id INT NOT NULL,
    store_id INT NOT NULL,
    date_of_purchase DATE NOT NULL,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
    FOREIGN KEY (store_id) REFERENCES stores(store_id)
);

CREATE TABLE sale_details (
    sales_id INT NOT NULL,
    product_id INT NOT NULL,
    quantity INT NOT NULL,
    price_per_unit DECIMAL(10, 2) NOT NULL,
    PRIMARY KEY (sales_id, product_id),
    FOREIGN KEY (sales_id) REFERENCES sales(sales_id),
    FOREIGN KEY (product_id) REFERENCES products(product_id)
)'''

# Execute the SQL statement to create the tables
connection.execute(stmt)

In [5]:
# load data from csv file
stores_df = pd.read_csv('stores.csv')
stores_df['store_manager'] = stores_df['store_manager'].str.replace(',', '')
stores_df.head()

,store_name,store_street,store_city,store_state,store_zipcode,store_manager,store_open_date,store_parking_capacity,store_expense_date,store_expense_type,store_expense_amount,store_expense_description
0,ABC Foodmart - DUMBO,123 Jay Street,Brooklyn,NY,11201,Hoffman Tina,6/18/2017,50,4/1/2024,rent,6500,April rent payment
1,ABC Foodmart - DUMBO,123 Jay Street,Brooklyn,NY,11201,Hoffman Tina,6/18/2017,50,3/1/2024,rent,6500,March rent payment
2,ABC Foodmart - DUMBO,123 Jay Street,Brooklyn,NY,11201,Hoffman Tina,6/18/2017,50,2/1/2024,rent,6500,February rent payment
3,ABC Foodmart - DUMBO,123 Jay Street,Brooklyn,NY,11201,Hoffman Tina,6/18/2017,50,1/1/2024,rent,6500,January rent payment
4,ABC Foodmart - DUMBO,123 Jay Street,Brooklyn,NY,11201,Hoffman Tina,6/18/2017,50,12/1/2023,rent,6000,December rent payment

In [6]:
employees_shifts_df = pd.read_csv('employees_shifts.csv')
employees_shifts_df.columns = [col.replace(" ", "_").lower() for col in employees_shifts_df.columns]
employees_shifts_df['employee_name'] = employees_shifts_df['employee_name'].str.replace(',', '')
employees_shifts_df['manager_name'] = employees_shifts_df['manager_name'].str.replace(',', '')
employees_shifts_df = employees_shifts_df.rename(columns={'store': 'store_name'})
employees_shifts_df = employees_shifts_df.rename(columns={'manager_name': 'store_manager'})
employees_shifts_df.head()

,employee_name,store_manager,email,date_of_hire,store_name,shift_start,shift_end,station,hourly_pay_rate
0,Sean Mr.,Farrell Christopher,mr..sean@abcfoodmart.com,3/25/2023,ABC Foodmart - Staten Island,4/14/2023 0:00,4/14/2023 0:00,seafood,12.60
1,Foster Jennifer,Hoffman Tina,jennifer.foster@abcfoodmart.com,6/15/2023,ABC Foodmart - DUMBO,7/8/2023 0:00,7/8/2023 0:00,dry goods,17.43
2,Shah Amanda,Hoffman Tina,amanda.shah@abcfoodmart.com,10/7/2023,ABC Foodmart - DUMBO,10/18/2023 0:00,10/18/2023 0:00,cashier,16.21
3,Garcia Sarah,Ellis Grant,sarah.garcia@abcfoodmart.com,12/14/2022,ABC Foodmart - Tribeca,1/6/2023 0:00,1/6/2023 0:00,cashier,15.74
4,Riley Ashley,Hoffman Tina,ashley.riley@abcfoodmart.com,8/17/2022,ABC Foodmart - DUMBO,8/27/2022 0:00,8/27/2022 0:00,customer service,13.23

In [7]:
products_vendor_orders_df = pd.read_csv('products_vendor_orders.csv')
products_vendor_orders_df.columns = [col.replace(" ", "_").lower() for col in products_vendor_orders_df.columns]
products_vendor_orders_df.head()

,vendor_name,vendor_email,order_number,store_name,delivery_date,product_name,product_description,category,unit_of_measurement,quantity,price_per_unit,expiration_date
0,"Wong, Mcdonald and Rodriguez",elizabethdavis@example.com,140ead02-1500-4660-897e-8773e7c34a6f,ABC Foodmart - Staten Island,6/9/2024,Water,"High-quality beverages item, Water, sourced re...",beverages,kg,18,3.04,8/21/2024
1,"Wong, Mcdonald and Rodriguez",elizabethdavis@example.com,140ead02-1500-4660-897e-8773e7c34a6f,ABC Foodmart - Staten Island,6/9/2024,Cough Syrup,"High-quality pharmacy item, Cough Syrup, sourc...",pharmacy,pieces,100,42.15,2/27/2025
2,"Wong, Mcdonald and Rodriguez",elizabethdavis@example.com,140ead02-1500-4660-897e-8773e7c34a6f,ABC Foodmart - Staten Island,6/9/2024,Beef Steak,"High-quality meats item, Beef Steak, sourced r...",meats,kg,93,72.48,11/24/2024
3,"Wong, Mcdonald and Rodriguez",elizabethdavis@example.com,140ead02-1500-4660-897e-8773e7c34a6f,ABC Foodmart - Staten Island,6/9/2024,Tulips,"High-quality floral item, Tulips, sourced resp...",floral,pieces,94,82.37,5/22/2025
4,"Wong, Mcdonald and Rodriguez",elizabethdavis@example.com,140ead02-1500-4660-897e-8773e7c34a6f,ABC Foodmart - Staten Island,6/9/2024,Lettuce,"High-quality fresh produce item, Lettuce, sour...",fresh produce,kg,76,86.02,8/5/2024

In [8]:
customers_sales_df = pd.read_csv('customers_sales.csv')
customers_sales_df.columns = [col.replace(" ", "_").lower() for col in customers_sales_df.columns]
customers_sales_df.head()

,customer_name,customer_email,store_name,date_of_purchase,product_name,quantity,price_per_unit
0,Kathy Jones,ucook@example.net,ABC Foodmart - Bay Ridge,7/14/2023 0:17,Roses,6,155.82
1,Kathy Jones,ucook@example.net,ABC Foodmart - Bay Ridge,7/14/2023 0:17,Roast Beef,10,147.62
2,Kathy Jones,ucook@example.net,ABC Foodmart - Bay Ridge,7/14/2023 0:17,Frozen Pizza,10,26.13
3,Kathy Jones,ucook@example.net,ABC Foodmart - Bay Ridge,7/14/2023 0:17,Cough Syrup,8,53.08
4,Kathy Jones,ucook@example.net,ABC Foodmart - Bay Ridge,7/14/2023 0:17,Lettuce,8,83.83

# ETL

# stores data

In [9]:
# 只保留stores相关列并去重
stores_data = stores_df[['store_name', 'store_street', 'store_city', 'store_state','store_zipcode','store_parking_capacity', 'store_open_date']].drop_duplicates()
stores_data.insert(0, 'store_id', range(1, 1 + len(stores_data)))
stores_data.head()

,store_id,store_name,store_street,store_city,store_state,store_zipcode,store_parking_capacity,store_open_date
0,1,ABC Foodmart - DUMBO,123 Jay Street,Brooklyn,NY,11201,50,6/18/2017
80,2,ABC Foodmart - Tribeca,133 Chambers Street,New York,NY,10013,0,1/9/2015
160,3,ABC Foodmart - Bay Ridge,8518 3rd Ave,Brooklyn,NY,11209,0,9/10/2009
240,4,ABC Foodmart - Whitestone,153-65 Cross Island Pkwy,Whitestone,NY,11357,200,6/5/2001
320,5,ABC Foodmart - Staten Island,2655 Richmond Ave,Staten Island,NY,10314,500,10/16/2012

In [10]:
# 将DataFrame数据写入数据库
stores_data.to_sql(name='stores', con=engine, if_exists='append', index=False)

5

# management data

In [11]:
store_id_list = [stores_data.store_id[stores_data.store_name == i].values[0] for i in stores_df.store_name]

stores_df.insert(0, 'store_id', store_id_list)

management_data = stores_df[[ 'store_id', 'store_manager']].drop_duplicates()

management_data.insert(0, 'manager_id', range(1, 1 + len(management_data)))

management_data.head()

     manager_id  store_id        store_manager
0             1         1         Hoffman Tina
80            2         2          Ellis Grant
160           3         3        Cooper Robert
240           4         4        Flores Angela
320           5         5  Farrell Christopher

In [12]:
management_data.to_sql(name='management', con=engine, if_exists='append', index=False)

5

# store expense type data

In [13]:
store_expense_type_data = stores_df[[ 'store_expense_type']].drop_duplicates()

store_expense_type_data.insert(0, 'expense_type_id', range(1, 1 + len(store_expense_type_data)))

store_expense_type_data.head()

    expense_type_id store_expense_type
0                 1               rent
40                2          utilities

In [14]:
store_expense_type_data.to_sql(name='store_expense_type', con=engine, if_exists='append', index=False)

2

# store expenses data

In [15]:
expense_type_id_list = [store_expense_type_data.expense_type_id[store_expense_type_data.store_expense_type == i].values[0] for i in stores_df.store_expense_type]

stores_df.insert(10, 'expense_type_id', expense_type_id_list)

store_expenses_data = stores_df[[ 'store_id', 'store_expense_date', 'expense_type_id', 'store_expense_amount', 'store_expense_description']]

store_expenses_data.head()

,store_id,store_expense_date,expense_type_id,store_expense_amount,store_expense_description
0,1,4/1/2024,1,6500,April rent payment
1,1,3/1/2024,1,6500,March rent payment
2,1,2/1/2024,1,6500,February rent payment
3,1,1/1/2024,1,6500,January rent payment
4,1,12/1/2023,1,6000,December rent payment

In [16]:
store_expenses_data.to_sql(name='store_expenses', con=engine, if_exists='append', index=False)

400

# employees data

In [17]:
employees_data = employees_shifts_df[[ 'employee_name', 'email', 'date_of_hire']].drop_duplicates()

employees_data.insert(0, 'employee_id', range(1, 1 + len(employees_data)))

# Display the first few rows of the software DataFrame
employees_data.head()

   employee_id    employee_name                            email date_of_hire
0            1         Sean Mr.         mr..sean@abcfoodmart.com    3/25/2023
1            2  Foster Jennifer  jennifer.foster@abcfoodmart.com    6/15/2023
2            3      Shah Amanda      amanda.shah@abcfoodmart.com    10/7/2023
3            4     Garcia Sarah     sarah.garcia@abcfoodmart.com   12/14/2022
4            5     Riley Ashley     ashley.riley@abcfoodmart.com    8/17/2022

In [18]:
employees_data.to_sql(name='employees', con=engine, if_exists='append', index=False)

100

# stations data

In [19]:
stations_data = employees_shifts_df[['station']].drop_duplicates()
stations_data.insert(0, 'station_id', range(1, 1 + len(stations_data)))

stations_data.head()

   station_id           station
0           1           seafood
1           2         dry goods
2           3           cashier
4           4  customer service
5           5     fresh produce

In [20]:
stations_data.to_sql(name='stations', con=engine, if_exists='append', index=False)

12

# shifts data

In [21]:
employee_id_list = [employees_data.employee_id[employees_data.employee_name == i].values[0] for i in employees_shifts_df.employee_name]

employees_shifts_df.insert(0, 'employee_id', employee_id_list)

station_id_list = [stations_data.station_id[stations_data.station == i].values[0] for i in employees_shifts_df.station]

employees_shifts_df.insert(8, 'station_id', station_id_list)

employees_shifts_df = employees_shifts_df.merge(stores_data[['store_id', 'store_name']], on='store_name', how='left')

employees_shifts_df = employees_shifts_df.merge(management_data[['manager_id', 'store_manager']], on='store_manager', how='left')

shifts_data = employees_shifts_df[[ 'employee_id', 'store_id', 'manager_id', 'station_id', 'shift_start', 'shift_end', 'hourly_pay_rate']]

shifts_data.insert(0, 'shift_id', range(1, 1 + len(shifts_data)))

shifts_data.head()

,shift_id,employee_id,store_id,manager_id,station_id,shift_start,shift_end,hourly_pay_rate
0,1,1,5,5,1,4/14/2023 0:00,4/14/2023 0:00,12.60
1,2,2,1,1,2,7/8/2023 0:00,7/8/2023 0:00,17.43
2,3,3,1,1,3,10/18/2023 0:00,10/18/2023 0:00,16.21
3,4,4,2,2,3,1/6/2023 0:00,1/6/2023 0:00,15.74
4,5,5,1,1,4,8/27/2022 0:00,8/27/2022 0:00,13.23

In [22]:
shifts_data.to_sql(name='shifts', con=engine, if_exists='append', index=False)

1000

# categories data

In [23]:
categories_data = products_vendor_orders_df[[ 'category']]

categories_data.insert(0, 'category_id', range(1, 1 + len(categories_data)))

categories_data.head()

   category_id       category
0            1      beverages
1            2       pharmacy
2            3          meats
3            4         floral
4            5  fresh produce

In [24]:
categories_data.to_sql(name='categories', con=engine, if_exists='append', index=False)

1000

# products data

In [25]:
category_id_list = [categories_data.category_id[categories_data.category == i].values[0] for i in products_vendor_orders_df.category]

products_vendor_orders_df.insert(7, 'category_id', category_id_list)

products_data = products_vendor_orders_df[[ 'category_id', 'product_name', 'product_description', 'unit_of_measurement']].drop_duplicates()

products_data.insert(0, 'product_id', range(1, 1 + len(products_data)))

products_data.head()

,product_id,category_id,product_name,product_description,unit_of_measurement
0,1,1,Water,"High-quality beverages item, Water, sourced re...",kg
1,2,2,Cough Syrup,"High-quality pharmacy item, Cough Syrup, sourc...",pieces
2,3,3,Beef Steak,"High-quality meats item, Beef Steak, sourced r...",kg
3,4,4,Tulips,"High-quality floral item, Tulips, sourced resp...",pieces
4,5,5,Lettuce,"High-quality fresh produce item, Lettuce, sour...",kg

In [26]:
products_data.to_sql(name='products', con=engine, if_exists='append', index=False)

99

# vendors data

In [27]:
vendors_data = products_vendor_orders_df[[ 'vendor_name', 'vendor_email']].drop_duplicates()

vendors_data.insert(0, 'vendor_id', range(1, 1 + len(vendors_data)))

vendors_data.head()

    vendor_id                   vendor_name                vendor_email
0           1  Wong, Mcdonald and Rodriguez  elizabethdavis@example.com
5           2               Hamilton-Burton     scottedward@example.net
10          3                  Cardenas Ltd     robinmoreno@example.com
15          4                  Matthews LLC  guerreroconnie@example.net
20          5   Hamilton, Briggs and Nguyen     herringeric@example.org

In [28]:
vendors_data.to_sql(name='vendors', con=engine, if_exists='append', index=False)

50

# orders data

In [29]:
vendor_id_list = [vendors_data.vendor_id[vendors_data.vendor_name == i].values[0] for i in products_vendor_orders_df.vendor_name]

products_vendor_orders_df.insert(0, 'vendor_id', vendor_id_list)

products_vendor_orders_df = products_vendor_orders_df.merge(stores_data[['store_id', 'store_name']], on='store_name', how='left')

orders_data = products_vendor_orders_df[[ 'order_number', 'vendor_id', 'store_id', 'delivery_date']].drop_duplicates()

orders_data.head()

                            order_number  vendor_id  store_id delivery_date
0   140ead02-1500-4660-897e-8773e7c34a6f          1         5      6/9/2024
5   849766ff-6b13-4de9-8169-e3cfb6832bbe          2         5      1/9/2025
10  4f83ccd2-5dad-4420-89c2-8365a60846d4          3         3     6/22/2024
15  1fcd017d-8cdb-4901-b874-39e43b3bbb0b          4         3     2/13/2025
20  a088b206-5765-4a0d-b384-1ed9dc274246          5         3     2/25/2025

In [30]:
orders_data.to_sql(name='orders', con=engine, if_exists='append', index=False)

1000

# order details data

In [31]:
product_id_list = [products_data.product_id[products_data.product_name == i].values[0] for i in products_vendor_orders_df.product_name]

products_vendor_orders_df.insert(5, 'product_id', product_id_list)

order_details_data = products_vendor_orders_df[[ 'order_number', 'product_id', 'quantity', 'price_per_unit', 'expiration_date']]

order_details_data.insert(0, 'order_id', range(1, 1 + len(order_details_data)))

order_details_data.head()

,order_id,order_number,product_id,quantity,price_per_unit,expiration_date
0,1,140ead02-1500-4660-897e-8773e7c34a6f,1,18,3.04,8/21/2024
1,2,140ead02-1500-4660-897e-8773e7c34a6f,2,100,42.15,2/27/2025
2,3,140ead02-1500-4660-897e-8773e7c34a6f,3,93,72.48,11/24/2024
3,4,140ead02-1500-4660-897e-8773e7c34a6f,4,94,82.37,5/22/2025
4,5,140ead02-1500-4660-897e-8773e7c34a6f,5,76,86.02,8/5/2024

In [32]:
order_details_data.to_sql(name='order_details', con=engine, if_exists='append', index=False)

1000

# customers data

In [33]:
customers_data = customers_sales_df[[ 'customer_name', 'customer_email']].drop_duplicates()

customers_data.insert(0, 'customer_id', range(1, 1 + len(customers_data)))

customers_data.head()

    customer_id      customer_name             customer_email
0             1        Kathy Jones          ucook@example.net
13            2       Richard Diaz    stephanie93@example.com
25            3      Steven Medina       dsanchez@example.net
38            4  Angela Washington  vickimitchell@example.com
47            5   Valerie Crawford    sabrinawade@example.org

In [34]:
customers_data.to_sql(name='customers', con=engine, if_exists='append', index=False)

1000

# sales data

In [35]:
customer_id_list = [customers_data.customer_id[customers_data.customer_name == i].values[0] for i in customers_sales_df.customer_name]

customers_sales_df.insert(0, 'customer_id', customer_id_list)

customers_sales_df = customers_sales_df.merge(stores_data[['store_id', 'store_name']], on='store_name', how='left')

customers_sales_df.insert(0, 'sales_id', range(1, 1 + len(customers_sales_df)))

sales_data = customers_sales_df[['sales_id', 'customer_id', 'store_id', 'date_of_purchase']]

sales_data.head()

   sales_id  customer_id  store_id date_of_purchase
0         1            1         3   7/14/2023 0:17
1         2            1         3   7/14/2023 0:17
2         3            1         3   7/14/2023 0:17
3         4            1         3   7/14/2023 0:17
4         5            1         3   7/14/2023 0:17

In [36]:
sales_data.to_sql(name='sales', con=engine, if_exists='append', index=False)

205

# sale details data

In [37]:
customers_sales_df = customers_sales_df.merge(products_data[['product_id', 'product_name']], on='product_name', how='left')

sale_details_data = customers_sales_df[[ 'sales_id', 'product_id', 'quantity', 'price_per_unit']]

sale_details_data.head()

   sales_id  product_id  quantity  price_per_unit
0         1          32         6          155.82
1         1          48         6          155.82
2         1          79         6          155.82
3         2          15        10          147.62
4         2          33        10          147.62

In [38]:
sale_details_data.to_sql(name='sale_details', con=engine, if_exists='append', index=False)

615

In [39]:
connection.close()